; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	image2 - mode
	infrared1 - mode
	spectrograph0 - mode
	Star2 - direction
	Star3 - direction
	GroundStation4 - direction
	Star6 - direction
	Star9 - direction
	GroundStation1 - direction
	GroundStation7 - direction
	GroundStation8 - direction
	Star5 - direction
	Star0 - direction
	Star10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Planet13 - direction
	Phenomenon14 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 infrared1)
	(calibration_target instrument0 GroundStation7)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 image2)
	(supports instrument1 infrared1)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation8)
	(calibration_target instrument1 Star5)
	(supports instrument2 infrared1)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star0)
	(calibration_target instrument2 Star5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet13)
)
(:goal (and
	(have_image Star10 image2)
	(have_image Phenomenon11 infrared1)
	(have_image Star12 spectrograph0)
	(have_image Planet13 spectrograph0)
	(have_image Phenomenon14 spectrograph0)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 5
2. (turn_to satellite0 star5 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 star5)
   goals met: 0 of 5
3. (calibrate satellite0 instrument1 star5)
   added: (calibrated instrument1)
   goals met: 0 of 5
4. (turn_to satellite0 phenomenon11 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon11)
   goals met: 0 of 5
5. (take_image satellite0 phenomenon11 instrument1 infrared1)
   added: (have_image phenomenon11 infrared1)
   goals met: 1 of 5
6. (turn_to satellite0 phenomenon14 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon14)
   goals met: 1 of 5
7. (take_image satellite0 phenomenon14 instrument1 spectrograph0)
   added: (have_image phenomenon14 spectrograph0)
   goals met: 2 of 5
8. (turn_to satellite0 planet13 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 planet13)
   goals met: 2 of 5
9. (take_image satellite0 planet13 instrument1 spectrograph0)
   added: (have_image planet13 spectrograph0)
   goals met: 3 of 5
10. (turn_to satellite0 star10 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 star10)
   goals met: 3 of 5
11. (take_image satellite0 star10 instrument1 image2)
   added: (have_image star10 image2)
   goals met: 4 of 5
12. (turn_to satellite0 star12 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star12)
   goals met: 4 of 5
13. (take_image satellite0 star12 instrument1 spectrograph0)
   added: (have_image star12 spectrograph0)
   goals met: 5 of 5
